templates/order-shipment-notification/version-1-0-0/get-order-shipment-notification.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <ns0:GetOrderShipmentNotificationRequest xmlns:ns0="http://www.promostandards.org/WSDL/OrderShipmentNotificationService/1.0.0/">
            <ns0:wsVersion>
                {{wsVersion}}
            </ns0:wsVersion>
            <ns0:id>
                {{username}}
            </ns0:id>
            <ns0:password>
                {{password}}
            </ns0:password>
            <ns0:queryType>{{queryType}}</ns0:queryType>
            <ns0:referenceNumber>{{referenceNumber}}</ns0:referenceNumber>
        </ns0:GetOrderShipmentNotificationRequest>
    </soap-env:Body>
</soap-env:Envelope>
